import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';

@Component({
  selector: 'app-faq',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './faq.component.html',
  styleUrl: './faq.component.css'
})
export class FaqComponent {
  openIndex: number | null = 0;

  faqs = [
    {q:'शिकायत दर्ज करने के लिए कौन-कौन सी मुख्य जानकारी आवश्यक है?',a:'आवेदक का नाम, पिता/पति का नाम, संपर्क नंबर, पूरा पता, संबंधित जिला/क्षेत्र तथा शिकायत का स्पष्ट विवरण आवश्यक होता है।'},
    {q:'क्या शिकायत के साथ PDF एवं साक्ष्य अपलोड किए जा सकते हैं?',a:'हाँ। शिकायत दर्ज करते समय आवेदन पत्र या साक्ष्य संबंधी एक PDF फ़ाइल (अधिकतम 10 MB) संलग्न की जा सकती है।'},
    {q:'शिकायत सफलतापूर्वक दर्ज होने पर क्या प्राप्त होगा?',a:'सफल ऑनलाइन पंजीकरण के तुरंत बाद एक Unique Complaint Reference Number (उदा. JS20260001) स्क्रीन पर दिखाया जाता है, जिससे ट्रैकिंग संभव होती है। कृपया इसे सुरक्षित रखें।'},
    {q:'क्या शिकायत की वर्तमान स्थिति मोबाइल या पोर्टल से देखी जा सकती है?',a:'हाँ। आवेदक Unique Reference Number दर्ज करके किसी भी समय शिकायत की वर्तमान स्थिति एवं प्रक्रिया इतिहास देख सकते हैं।'},
    {q:'क्या शिकायत को संबंधित या अन्य विभाग को अग्रेषित किया जा सकता है?',a:'हाँ। Case Workflow में संबंधित सक्षम विभाग, नोडल शाखा या क्षेत्रीय कार्यालय को शिकायत प्रेषित करने की सुव्यवस्थित प्रक्रिया निहित है।'},
    {q:'शिकायत निस्तारण का अंतिम चरण क्या होता है?',a:'समीक्षा एवं फील्ड जांच के पश्चात अंतिम कार्रवाई रिपोर्ट अपलोड कर शिकायत को आधिकारिक रूप से बंद (Closed) किया जाता है।'}
  ];

  toggle(index: number): void {
    this.openIndex = this.openIndex === index ? null : index;
  }
}
